In [16]:
import pandas as pd

In [17]:
df = pd.read_csv('train (2).csv')

In [18]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [19]:
df['Age'].mean()

29.69911764705882

Средний возраст пассажиров 29 лет

In [28]:
df.groupby('Survived').agg({'Age': 'mean'})

                Age
Survived
0         30.626179
1         28.343690

Средний возраст выживших пассажиров 28 лет

In [20]:
df.groupby([ 'Embarked', 'Survived']).agg({'Survived': 'sum'})

                   Survived
Embarked Survived
C        0                0
         1               93
Q        0                0
         1               30
S        0                0
         1              217

In [21]:
df.Embarked.value_counts()

S    644
C    168
Q     77
Name: Embarked, dtype: int64

Максимальное количество выживших из Саутгемптона, т.к. их изначально было больше

In [23]:
df.groupby([ 'Sex', 'Survived']).agg({'Survived': 'sum'})

                 Survived
Sex    Survived
female 0                0
       1              233
male   0                0
       1              109

Женщин выжило гораздо больше

In [24]:
df.groupby([ 'Pclass', 'Survived']).agg({'Survived': 'sum'})

                 Survived
Pclass Survived
1      0                0
       1              136
2      0                0
       1               87
3      0                0
       1              119

In [25]:
df.Pclass.value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

Выжило больше представителей первого класса, т.к. их спасали в первую очередь